# Используем образ Node.js в качестве базового образа
FROM node:20-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы проекта в рабочую директорию
COPY . .

# Собираем приложение
RUN npm run build

# Определяем порт, который будет прослушиваться внутри контейнера
EXPOSE 3000

# Запускаем приложение при старте контейнера
CMD [ "npm", "run", "start:prod" ]